app/Controllers/Products.php

SELECT *
FROM `products`
---
    public function index()
    {
        $products = $this->productModel->findAll();