app/Models/Category_model.php

    public function getAllCategories()
    {
        return $this->findAll();
---
SELECT *
FROM `categories`